---
kind: property
id: P:Autodesk.Revit.DB.FabricationDimensionDefinition.UnitType
source: html/e7bb5563-3443-bf31-d28b-db98d6ab094b.htm
---
# Autodesk.Revit.DB.FabricationDimensionDefinition.UnitType Property

Fabrication dimension unit type.

## Syntax (C#)
```csharp
public FabricationDimensionUnitType UnitType { get; }
```